<?php

namespace App\Console\Commands;

use App\Console\HandledCommand;
use App\Models\CRM\CostItem;
use App\Models\KostCode;
use App\Models\Payment;

class UpdateCRMPaymentCodes extends HandledCommand
{
    protected $signature = 'oms:update-crm-payment-codes';

    protected $description = 'Исправляет статья затрат оплат в кассах CRM';

    protected string $period = 'Вручную';

    public function __construct()
    {
        parent::__construct();
    }

    public function handle()
    {
//        if ($this->isProcessRunning()) {
//            return 0;
//        }
//
//        $this->startProcess();

        $newCodes = [
            "1.1.1" => "1.1.1",
            "1.1.2" => "1.2.1",
            "1.1.3" => "1.1.3",
            "1.1.4" => "1.1.4",
            "1.1.5" => "1.1.5",
            "1.1.6" => "1.1.6",
            "1.1.7" => "1.1.100",
            "1.2.1" => "1.2.2",
            "1.2.2" => "1.2.3",
            "1.2.3" => "1.2.4",
            "1.2.4" => "1.2.100",
            "2.1.1" => "2.1.1",
            "2.1.2" => "2.1.2",
            "2.1.3" => "2.1.3",
            "2.1.4" => "2.1.4",
            "2.1.5" => "2.1.5",
            "2.1.6" => "2.1.5",
            "2.1.7" => "2.1.6",
            "2.1.8" => "2.1.6",
            "2.1.9" => "2.1.100",
            "2.1.10" => "2.1.101",
            "2.2.1" => "2.2.1",
            "2.2.2" => "2.2.1",
            "2.2.3" => "2.2.1",
            "2.2.4" => "2.2.1",
            "3.1.1" => "3.1.1",
            "3.1.2" => "3.1.1",
            "3.1.3" => "3.1.1",
            "3.1.4" => "3.1.1",
            "3.1.5" => "3.1.1",
            "3.2.1" => "3.2.1",
            "3.2.2" => "3.2.2",
            "3.2.3" => "3.2.3",
            "4.1" => "4.1",
            "4.2" => "4.2",
            "4.3" => "4.3",
            "4.4" => "4.4",
            "4.5" => "4.5",
            "4.6" => "4.100",
            "5.1" => "5.1",
            "5.2" => "5.1",
            "5.3" => "5.3",
            "5.4" => "5.4",
            "5.5" => "5.5",
            "5.6" => "5.5",
            "5.7" => "5.5",
            "5.8" => "5.6",
            "5.9" => "5.7",
            "5.10" => "5.8",
            "6.1" => "6.1",
            "6.2" => "6.1",
            "6.3" => "6.1",
            "6.4" => "6.3",
            "6.5" => "6.3",
            "6.6" => "6.4",
            "6.7" => "6.5",
            "7.1" => "7.5",
            "7.2" => "7.1",
            "7.4" => "7.4",
            "7.3" => "7.100",
            "7.5" => "5.2",
            "7.6" => "7.30",
            "7.7" => "7.12",
            "7.8" => "7.26",
            "7.9" => "7.25",
            "7.10" => "7.24",
            "7.11" => "7.21",
            "7.12" => "7.22",
            "7.13" => "7.16",
            "7.14" => "7.6",
            "7.15" => "7.11",
            "7.17" => "7.9",
            "7.17.1" => "7.9.1",
            "7.17.2" => "7.9.2",
            "7.18" => "7.10",
            "7.20" => "7.2",
            "7.21.1" => "5.11.1",
            "7.21.2" => "5.11.2",
            "7.22" => "7.101",
            "7.23" => "8.2",
            "7.24" => "5.13",
            "7.25" => "7.17",
            "7.26" => "7.8",
            "7.26.1" => "7.8.1",
            "7.26.2" => "7.8.2",
            "7.27" => "7.18",
            "7.28" => "7.19",
            "7.29" => "7.31",
            "7.30.1" => "5.14.1",
            "7.30.2" => "5.14.2",
            "7.31" => "7.27",
            "7.32" => "7.32",
            "7.33" => "7.28",
            "7.34" => "7.29",
            "7.35" => "7.7",
            "7.36" => "7.33",
            "7.37" => "7.23",
            "7.19" => "7.3",
            "8.1" => "8.1",
            "9.1" => "9.1",
            "9.2" => "9.2",
            "9.3" => "9.3",
            "9.4" => "9.4",
            "9.5" => "9.5",
            "10.1" => "10.1",
            "10.2" => "10.2",
            "10.3" => "10.3",
            "10.4" => "10.4",
            "10.5" => "10.5",
            "10.6" => "10.6",
            "10.7" => "10.7",
            "10.8" => "10.8",
        ];

        $this->sendInfoMessage('Старт исправления статей затрат оплат');

        foreach ($newCodes as $oldCode => $newCode) {
            if ($oldCode === $newCode) {
                continue;
            }

            $this->sendInfoMessage('Исправление кода "' . $oldCode . '" на "' . $newCode . '"');

            $this->sendInfoMessage('Найдено ' . CostItem::whereIn('new_cost_code', [$oldCode, ' ' . $oldCode, '  ' . $oldCode, $oldCode . ' ', $oldCode . '  '])->count() . ' оплат');

            CostItem::whereIn('new_cost_code', [$oldCode, ' ' . $oldCode, '  ' . $oldCode, $oldCode . ' ', $oldCode . '  '])->update([
                'new_cost_code' => $newCode . '***'
            ]);

            $this->sendInfoMessage('Оплаты исправлены');
        }

        $this->sendInfoMessage('Замена измененных статей на корректные');

        foreach ($newCodes as $oldCode => $newCode) {
            if ($oldCode === $newCode) {
                continue;
            }

            $this->sendInfoMessage('Исправление кода "' . $newCode . '***" на "' . $newCode . '"');

            $this->sendInfoMessage('Найдено ' . CostItem::where('new_cost_code', $newCode . '***')->count() . ' оплат');

            CostItem::where('new_cost_code', $newCode . '***')->update([
                'new_cost_code' => $newCode
            ]);

            $this->sendInfoMessage('Оплаты исправлены');
        }

        $this->sendInfoMessage('Исправление статей затрат в оплатах завершено');

        $this->endProcess();

        return 0;
    }
}
