app/Services/OrganizationService.php

    public function getOrCreateOrganization(array $requestData): Organization
    {
        $requestData['name'] = $this->sanitizer->set($requestData['name'])->get();
        $requestData['inn'] = $this->sanitizer->set($requestData['inn'])->toNumber()->get();
        $requestData['kpp'] = $this->sanitizer->set($requestData['kpp'])->toNumber()->get();

        $organization = Organization::where('name', $requestData['name'])->where('inn', $requestData['inn'])->first();
---
select * from `organizations` where `name` = 'ООО \"Строй Техно Инженеринг\"' and `inn` = '7720734368' and `organizations`.`deleted_at` is null limit 1