app/Services/PaymentService.php

update `payments` set `object_id` = '', `object_worktype_id` = '', `type_id` = 0, `payments`.`updated_at` = '2021-10-06 07:42:11' where `id` = 80
---
    public function updatePayment(Payment $payment, array $requestData): Payment
    {
        if (array_key_exists('amount', $requestData)) {
            $description = array_key_exists('description', $requestData) ? $requestData['description'] : $payment->description;
            $requestData['amount'] = $this->sanitizer->set($requestData['amount'])->toAmount()->get();
            $nds = $this->checkHasNDSFromDescription($description) ? round($requestData['amount'] / 6, 2) : 0;
            $requestData['amount_without_nds'] = $requestData['amount'] - $nds;
        } elseif (array_key_exists('object_id', $requestData)) {
            if (str_contains($requestData['object_id'], '::')) {
                $objectData = explode('::', $requestData['object_id']);
                $requestData['type_id'] = Payment::TYPE_OBJECT;
                $requestData['object_id'] = (int) $objectData[0];
                $requestData['object_worktype_id'] = (int) $objectData[1];
            } else {
                $requestData['type_id'] = (int) $requestData['object_id'];
                $requestData['object_id'] = null;
                $requestData['object_worktype_id'] = null;
            }
        } elseif (array_key_exists('code', $requestData)) {
            $requestData['code'] = $this->sanitizer->set($requestData['code'])->toCode()->get();
        }

        $payment->update($requestData);

update `payments` set `deleted_at` = '2021-10-06 07:42:49', `payments`.`updated_at` = '2021-10-06 07:42:49' where `id` = 1
---
    public function destroyPayment(Payment $payment): Payment
    {
        $payment->delete();