app/Services/StatementService.php


            $isNeedSplit = $this->paymentService->checkIsNeedSplitFromDescription($payment['description']);

            $this->paymentService->createPayment([
                'company_id' => $statement->company_id,
                'bank_id' => $statement->bank_id,
                'statement_id' => $statement->id,
                'object_id' => null,
                'object_worktype_id' => null,
                'organization_sender_id' => $organizationSender->id,
                'organization_receiver_id' => $organizationReceiver->id,
                'type_id' => Payment::TYPE_NONE,
                'payment_type_id' => Payment::PAYMENT_TYPE_NON_CASH,
                'code' => null,
                'category' => $this->paymentService->findCategoryFromDescription($payment['description']),
                'description' => $payment['description'],
                'date' => $statement->date,
                'amount' => $amount,
                'amount_without_nds' => $amount - $nds,
                'is_need_split' => $isNeedSplit,
                'status_id' => Status::STATUS_BLOCKED
            ]);
        }

        $statement->update([
            'incoming_balance' => $processInfo['incoming_balance'],
            'outgoing_balance' => $processInfo['outgoing_balance']
        ]);
---
select * from `payments` where `payments`.`statement_id` = 1 and `payments`.`statement_id` is not null and `payments`.`deleted_at` is null
update `statements` set `incoming_balance` = 17984789.02, `outgoing_balance` = 3690012.1, `updated_by_user_id` = 1, `statements`.`updated_at` = '2021-10-06 07:47:35' where `id` = 1

    public function destroyStatement(Statement $statement): Statement
    {
        $statement->delete();
---
update `statements` set `deleted_at` = '2021-10-06 07:42:48', `statements`.`updated_at` = '2021-10-06 07:42:48' where `id` = 1