app/Http/Controllers/Role/RoleController.php

select * from `roles`
---
    public function index(): View
    {
        $roles = Role::all();