app/Http/Controllers/User/UserController.php

    public function index(): View
    {
        $users = User::withTrashed()->with('roles')->get();
---
select * from `users`