app/Models/Object/BObject.php

select * from `objects` where `objects`.`deleted_at` is null order by `code` asc
---
    public static function getObjectsList(): array
    {
        $result = [];
        $workTypes = WorkType::getWorkTypes();
        $objects = static::orderBy('code')->get();