app/Exports/Statement/StatementExport.php

select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `objects` where `objects`.`id` in (1) and `objects`.`deleted_at` is null
select * from `organizations` where `organizations`.`id` in (1, 29, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52) and `organizations`.`deleted_at` is null
select * from `payments` where `payments`.`statement_id` in (2) and `payments`.`deleted_at` is null
---
    public function __construct(Statement $statement)
    {
        $this->statement = $statement->load(
            'payments',
            'payments.object',
            'payments.company',
            'payments.organizationReceiver',
            'payments.organizationSender'
        );