app/Http/Controllers/Object/ObjectController.php

    public function index(): View
    {
        $objects = BObject::orderByDesc('code')->get();
---
select * from `objects` where `objects`.`deleted_at` is null order by `code` desc