app/Http/Controllers/Statement/StatementController.php

select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `statements` where `statements`.`deleted_at` is null order by `date` desc, `id` desc
---
    public function index(): View
    {
        $statements = Statement::with('company', 'createdBy')->orderByDesc('date')->orderByDesc('id')->get();

select * from `companies` where `companies`.`deleted_at` is null
---
    public function create(): View
    {
        $companies = Company::all();

select * from `organizations` where `organizations`.`id` in (1, 53) and `organizations`.`deleted_at` is null
select * from `payments` where `payments`.`statement_id` in (2) and `payments`.`deleted_at` is null
---
    public function show(Statement $statement): View
    {
        $statement->load(['payments', 'payments.organizationSender', 'payments.organizationReceiver']);

select * from `organizations` where `organizations`.`id` in (1) and `organizations`.`deleted_at` is null
select * from `payments` where `payments`.`statement_id` in (1) and `payments`.`deleted_at` is null
---
    public function edit(Statement $statement): View
    {
        $categories = Payment::getCategories();
        $objects = Payment::getTypes() + BObject::getObjectsList();
        $statement->load(['payments', 'payments.organizationSender', 'payments.organizationReceiver']);