app/Http/Controllers/Organization/OrganizationController.php

select * from `organizations` where `organizations`.`deleted_at` is null order by `name` asc
---
    public function index(): View
    {
        $organizations = Organization::orderBy('name')->get();