app/Http/Controllers/Company/CompanyController.php

select * from `companies` where `companies`.`deleted_at` is null order by `name` asc
---
    public function index(): View
    {
        $companies = Company::orderBy('name')->get();