app/Http/Controllers/Payment/PaymentController.php

select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `payments` where `payments`.`deleted_at` is null order by `date` desc, `id` desc
---
    public function index()
    {
        $payments = Payment::with('company', 'createdBy')->orderByDesc('date')->orderByDesc('id')->get();