<?php

namespace App\Models;

class KostCode
{
    private static array $codes = [
        [
            'code' => '10',
            'title' => 'Поступления',
            'description' => '',
            'children' => [
                [
                    'code' => '10.1',
                    'title' => 'Аванс целевой',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.2',
                    'title' => 'Аванс общий',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.3',
                    'title' => 'Выполнение',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.4',
                    'title' => 'Гарантийное удержание',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.5',
                    'title' => 'Услуги генподряда, ретробонус',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.6',
                    'title' => 'Займ, кредит, %',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.7',
                    'title' => 'Трансфер',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.8',
                    'title' => 'Прочие поступления',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '0',
            'title' => 'Статья затрат еще не определена',
            'description' => '',
            'children' => [],
        ],
        [
            'code' => '1',
            'title' => 'Строительные работы',
            'description' => '',
            'children' => [
                [
                    'code' => '1.1',
                    'title' => 'Общестроительные работы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '1.1.1',
                            'title' => 'Монолитные работы (железобетонные работы)',
                            'description' => 'Расчистка территорий , разборка и демонтаж зданий и сооружений. Строительство временных дорог, инженерных сетей и сооружени. Разработка грунта, уплотнение грунт  Опалубочные работы, армирование, бетонирование…Оклейочная гидроизоляция, обмазочная гидроизоляция, литая или напыляемая гидроизоляция, пропиточная гидроизоляция, инъекционная гидроизоляция…Свайные работы, монтаж шпунта, ростверков…',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.2',
                            'title' => 'Черновая отделка (кирпичная кладка, штукатурка, стяжка, гипсокартонные перегородки, облицовка и потолки)',
                            'description' => 'Кирпичная кладка, штукатурка, стяжка, гипсокартонные перегородки, облицовка и потолки',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.3',
                            'title' => 'Фасадные работы (фасад и фасадное остекление)',
                            'description' => 'Фасад, окна, фасадные двери, витражи…',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.4',
                            'title' => 'Кровельные работы',
                            'description' => 'Скатные и плоские кровли, отливы, желобы',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.5',
                            'title' => 'Ограждения',
                            'description' => 'Ограждения внутренние и наружные',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.6',
                            'title' => 'Разные работы (сверление отверстий, уборка, подъём материалов, проходки…)',
                            'description' => 'Работы по благоустройству территории, озеленение, дорожки, площадки…сверленые отверстий, уборка, подъём материалов, проходки…',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.7',
                            'title' => 'Материалы',
                            'description' => 'Работы по благоустройству территории, озеленение, дорожки, площадки…',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '1.2',
                    'title' => 'Отделочные работы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '1.2.1',
                            'title' => 'Полы (паркет, ламинат, ковровые покрытия, линолеум, виниловые покрытия,  эпоксидные покрытия…) ',
                            'description' => 'Финишная отделка полов, паркет, камень, плитка, ламинат, ковровые покрытия, линолеум, виниловые покрытия, эпоксидные покрытия...',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.2',
                            'title' => 'Стены (малярка, обои, декоратывная штукатурка…) ',
                            'description' => 'Финишная отделка стен, малярка, обои, декоративная штукатурка, камень, плитка, изделия из металла…',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.3',
                            'title' => 'Потолки (малярка, обои, натяжные потолки, минеральные потолки, металические потолки) ',
                            'description' => 'Финишная отделка потолков, малярка, обои, натяжные потолки, минеральные потолки, металические потолки…',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.4',
                            'title' => 'Материалы',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ]
            ]
        ],
        [
            'code' => '2',
            'title' => 'Механические системы',
            'description' => '',
            'children' => [
                [
                    'code' => '2.1',
                    'title' => 'Внутренние системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '2.1.1',
                            'title' => 'Отопление',
                            'description' => 'Монтаж системи отопления, трубная разводка…оконечного оборудования, отопительных приборов…',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.2',
                            'title' => 'Вентиляция',
                            'description' => 'Монтаж воздуховодов, отводов, переходов…Монтаж оборудования системи вентиляции, вентиляторы, фильтри, калорифери…',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.3',
                            'title' => 'Кондиционирование',
                            'description' => 'Монтаж траси системи кондиционирования, трубная разводка, система дренажа…Монтаж оборудования системи кондиционирования, кондиционеры, чилери…',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.4',
                            'title' => 'ИТП и котельная',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.5',
                            'title' => 'Спринклерная система пожаротушения',
                            'description' => 'Монтаж оборудования системи кондиционирования, кондиционеры, чилеры…',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.6',
                            'title' => 'Гидранты',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.7',
                            'title' => 'Водопровод и канализация',
                            'description' => 'Монтаж системи водоснабжения и канализации, трубная разводка…Монтаж оборудования системи ВК, сантехника, трапы, насосы',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.8',
                            'title' => 'Оборудование ВК',
                            'description' => 'Монтаж оборудования системи ВК, сантехника, трапы, насосы…',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.9',
                            'title' => 'Изоляция',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.10',
                            'title' => 'Материалы',
                            'description' => '',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '2.2',
                    'title' => 'Наружные системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '2.2.1',
                            'title' => 'Теплотрасса',
                            'description' => 'Проведение трубопроводов теплоснабжения, монтаж запорной арматуры и оборудования сетей теплоснабжения, устройство колодцев и камер сетей теплоснабжения',
                            'children' => []
                        ],
                        [
                            'code' => '2.2.2',
                            'title' => 'Водоснабжение и канализация',
                            'description' => 'Укладка трубопроводов водопроводных, монтаж запорной арматуры и оборудования водопроводных сетей, устройство водопроводных колодцев',
                            'children' => []
                        ],
                        [
                            'code' => '2.2.3',
                            'title' => 'ИТП и котельная',
                            'description' => 'Монтаж оборудовани котельной… (Укладка трубопроводов газоснабжения, монтаж запорной арматуры и оборудования - если снабжение газом )',
                            'children' => []
                        ],
                        [
                            'code' => '2.2.4',
                            'title' => 'Материалы',
                            'description' => '',
                            'children' => []
                        ],
                    ]
                ]
            ]
        ],
        [
            'code' => '3',
            'title' => 'Электрические системы',
            'description' => '',
            'children' => [
                [
                    'code' => '3.1',
                    'title' => 'Наружные  системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '3.1.1',
                            'title' => 'Сильный ток',
                            'description' => 'кабельная продукция, колодцы, кабельная канализация, силовое оборудованые…',
                            'children' => []
                        ],
                        [
                            'code' => '3.1.2',
                            'title' => 'Слабый ток',
                            'description' => 'кабельная продукция, колодцы, кабельная канализация, слаботочное оборудованые…',
                            'children' => []
                        ],
                        [
                            'code' => '3.1.3',
                            'title' => 'Наружное освещение',
                            'description' => 'кабельная продукция, светильники и приборы',
                            'children' => []
                        ],
                        [
                            'code' => '3.1.4',
                            'title' => 'Фасадное освещение',
                            'description' => 'кабельная продукция, светильники и приборы',
                            'children' => []
                        ],
                        [
                            'code' => '3.1.5',
                            'title' => 'ДГУ (Дизель-генераторная установка)',
                            'description' => '',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '3.2',
                    'title' => 'Внутриние системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '3.2.1',
                            'title' => 'Сильный ток',
                            'description' => 'кабельная продукция, силовое оборудование, щитовое оборудование, оконечное оборудование, светильники, розетки, выключатели…',
                            'children' => []
                        ],
                        [
                            'code' => '3.2.2',
                            'title' => 'Слабый ток',
                            'description' => 'кабельная продукция, слаботочное оборудование, оконечные элементы слаботочных систем…',
                            'children' => []
                        ],
                        [
                            'code' => '3.2.3',
                            'title' => 'Автоматика',
                            'description' => 'кабельная продукция, оконечные элементы систем автоматики…',
                            'children' => []
                        ],
                    ]
                ]
            ]
        ],
        [
            'code' => '4',
            'title' => 'Оснащение',
            'description' => '',
            'children' => [
                [
                    'code' => '4.1',
                    'title' => 'Мебель',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '4.2',
                    'title' => 'Лифты',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '4.3',
                    'title' => 'Технологическое оборудование ',
                    'description' => '(лифты, кухня, ТВ, мусоропровод, белепровод, оборудования для бассейнов)',
                    'children' => []
                ],
                [
                    'code' => '4.4',
                    'title' => 'Материалы',
                    'description' => 'зеркала, шторы, декаративные элементы и прочее',
                    'children' => []
                ],
                [
                    'code' => '4.5',
                    'title' => 'Двери',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '4.6',
                    'title' => 'Дизайн освещение',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '5',
            'title' => 'Содержание площадки',
            'description' => '',
            'children' => [
                [
                    'code' => '5.1',
                    'title' => 'Штаб строительства',
                    'description' => 'расходы на содержание ИТР',
                    'children' => []
                ],
                [
                    'code' => '5.2',
                    'title' => 'Городок',
                    'description' => 'покупку или аренда контейнеров, а так же его содержание и обслуживание',
                    'children' => []
                ],
                [
                    'code' => '5.3',
                    'title' => 'Система учета и контроля (КПП, видеонаблюдение)',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.4',
                    'title' => 'ЧОП/охрана',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.5',
                    'title' => 'Временное электричество',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.6',
                    'title' => 'Временное отопление',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.7',
                    'title' => 'Временная канализация',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.8',
                    'title' => 'Вывоз мусора',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.9',
                    'title' => 'Коммунальные услуги',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.10',
                    'title' => 'Спецодежда и СИЗ',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '6',
            'title' => 'Проектирование',
            'description' => '',
            'children' => [
                [
                    'code' => '6.1',
                    'title' => 'Архитектурные и конструктивные решения',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.2',
                    'title' => 'Дизайнерская концепция',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.3',
                    'title' => 'Дизайн проект',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.4',
                    'title' => 'Водопровод и канализация',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.5',
                    'title' => 'Механические системы',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.6',
                    'title' => 'Электрические системы (Сильные и слабые токи, автоматика)',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.7',
                    'title' => 'Остальные разделы (Энергоэффективность, Маломобильние группы населения, ПОС, Охрана окружающей среды)',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '7',
            'title' => 'Офисные расходы',
            'description' => '',
            'children' => [
                [
                    'code' => '7.1',
                    'title' => 'Прочие налоги',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.2',
                    'title' => 'НДС',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.3',
                    'title' => 'Налог на имущество',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.4',
                    'title' => 'Штрафы, пени, неустойки, госпошлины',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.5',
                    'title' => 'Командировочные расходы (гостиница, питание, трансфер)',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.6',
                    'title' => 'Топливо',
                    'description' => 'пополнение счёта топливных карт АЗС, бензин, дизтопливо, ГСМ',
                    'children' => []
                ],
                [
                    'code' => '7.7',
                    'title' => 'Расходы HR (HH, обучение, регистрация, приглашения, наркология, страхование и др.)',
                    'description' => 'Оплата сервисов по подбору сотрудников (Яндекс, HeadHunter), журналов регистраций, полисов и сертификатов для разрешений на работу сотрудникам, ТАКСКОМ .Затраты на оформление сотрудников,страховки, Расходы за ведение воинского учёта, переводов документов, квотирование. Обучение персонала. Оплата проезда в Сахарово (такси, автобусы для получения патентов на работу)',
                    'children' => []
                ],
                [
                    'code' => '7.8',
                    'title' => 'Отправка документов (почта, DHL)/ Почтово-курьерские услуги',
                    'description' => 'Расходы на почтово-курьерские услуги',
                    'children' => []
                ],
                [
                    'code' => '7.9',
                    'title' => 'Маркетинг',
                    'description' => 'Оплата SMM (Маркетинг в социальных сетях), Расходы на рекламную продукцию (визитки,таблички, пакеты, шевроны, вымпелы, буклеты, блакноты и т.д.) Выставки, семинары ,мероприятия Расходы на презенты',
                    'children' => []
                ],
                [
                    'code' => '7.10',
                    'title' => 'Расходы офиса (канцтовары, вода, продукты, бытовая химия)',
                    'description' => 'Оплата канцтоваров, кофе, питьевой воды, посуды, хоз.товаров,лекарств и т.д. Расходы на ремонт офисов, СКУД, закупка общего инструмента, пополнение корп.карты',
                    'children' => []
                ],
                [
                    'code' => '7.11',
                    'title' => 'Аренда офиса',
                    'description' => 'Оплата аренды офисов, обслуживание офисов (ЖКХ (водоснабжение, электричество) Охрана, БТИ)',
                    'children' => []
                ],
                [
                    'code' => '7.12',
                    'title' => 'Аренда склада',
                    'description' => 'Оплата аренды склада',
                    'children' => []
                ],
                [
                    'code' => '7.13',
                    'title' => 'Бухгалтерский учет и аудит',
                    'description' => 'Оплата услуг аудита,  базы данных Главбух, СКЗИ (Средства криптографической защиты)',
                    'children' => []
                ],
                [
                    'code' => '7.14',
                    'title' => 'Банковские затраты (комиссии, переводы, РКО и пр.)',
                    'description' => 'Оплата банковских комиссий за переводы денег, оплата Бизнес Онлайн, электронная подпись',
                    'children' => []
                ],
                [
                    'code' => '7.15',
                    'title' => 'Трансфер',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.17',
                    'title' => 'Зарплата',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '7.17.1',
                            'title' => 'Зарплата (ИТР)',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '7.17.2',
                            'title' => 'Зарплата (Рабочие)',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.18',
                    'title' => 'Премия',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.19',
                    'title' => 'Налоги с зарплаты (НДФЛ, соц.страх.)',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.20',
                    'title' => 'Налог на прибыль',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.21',
                    'title' => 'Транспорт сотрудников (авиа/железнодорожный)',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.22',
                    'title' => 'Транспорт сотрудников (от места пребывания до стройки)',
                    'description' => 'Оплата услуг пассажирских перевозок (заказ автобусов для рабочих, такси). Оплата проездных сотрудникам',
                    'children' => []
                ],
                [
                    'code' => '7.23',
                    'title' => 'Грузовой и авиатранспорт грузов',
                    'description' => 'Оплата за услуги доставки ',
                    'children' => []
                ],
                [
                    'code' => '7.24',
                    'title' => 'Питание сотрудников',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.25',
                    'title' => 'СРО (разрешение на работу/членские взносы), сертификация, лицензирование, страхование СМР',
                    'description' => 'Оплата членских взносов саморегулируемых организаций, юридических сертификатов и лицензий ',
                    'children' => []
                ],
                [
                    'code' => '7.26',
                    'title' => 'Аванс',
                    'description' => 'Оплата авансов сотрудникам',
                    'children' => [
                        [
                            'code' => '7.26.1',
                            'title' => 'Аванс (ИТР)',
                            'description' => 'Оплата авансов сотрудникам (ИТР)',
                            'children' => []
                        ],
                        [
                            'code' => '7.26.2',
                            'title' => 'Аванс (Рабочие)',
                            'description' => 'Оплата авансов сотрудникам (Рабочие)',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.27',
                    'title' => 'Консалтинг',
                    'description' => 'Оплата информационно-консультационных услуг, оплата нотариуса',
                    'children' => []
                ],
                [
                    'code' => '7.28',
                    'title' => 'Адвокат',
                    'description' => 'Оплата адвоката (Оказание юридической помощи)',
                    'children' => []
                ],
                [
                    'code' => '7.29',
                    'title' => 'Расходы на автотранспорт (лизинг, ТО, запчасти, страховки (КАСКО, ОСАГО))',
                    'description' => 'Расходы на приобретение автомобилей и спецтехники  (Лизинг). Обслуживание автомобилей и спецтехники ( замена расходников, ремонт, ГЛОНАС, установка сигнализации, вызов эвакуатора для автомобилей). Оплата парковок, платных дорог. Страхование автомобилей (ОСАГО, КАСКО)',
                    'children' => []
                ],
                [
                    'code' => '7.30',
                    'title' => 'Размещение сотрудников',
                    'description' => 'Аренда квартир сотрудникам (аренда, ЖКХ услуги, парковка). Аренда общежитий, гостиниц, хостел',
                    'children' => []
                ],
                [
                    'code' => '7.31',
                    'title' => 'Услуги связи (телефон, интернет)',
                    'description' => 'Оплата интернет-провайдеров в офисах,  МГТС услуги телефонии в офисах, мобильная связь',
                    'children' => []
                ],
                [
                    'code' => '7.32',
                    'title' => 'Прочие расходы',
                    'description' => 'Проведение праздников, благотворительность, представительские расходы и т.д.',
                    'children' => []
                ],
                [
                    'code' => '7.33',
                    'title' => 'Оргтехника (МФУ, компьютерная техника)',
                    'description' => 'Покупка компьютерной техники (ноутбуков, мониторов, принтеров, жестких дисков, сетевых расходных материалов, флеш накопителей и пр.). Обслуживание МФУ (ремонт МФУ, замена/заправка картриджей)',
                    'children' => []
                ],
                [
                    'code' => '7.34',
                    'title' => 'Программное обеспечение',
                    'description' => 'Оплата разработки 1С, разработки ПО для ЭВМ, аудит IT,сопровождение 1С',
                    'children' => []
                ],
                [
                    'code' => '7.35',
                    'title' => 'Кредиты, займы, %, депозиты/овернайт',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.36',
                    'title' => 'Переброска',
                    'description' => 'Перевод собственных средств, ошибочные платежи с ДТ',
                    'children' => []
                ],
                [
                    'code' => '7.37',
                    'title' => 'Капитальный ремонт офиса, мебель',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '8',
            'title' => 'Транспортные услуги',
            'description' => '',
            'children' => [
                [
                    'code' => '8.1',
                    'title' => 'Транспортные услуги',
                    'description' => 'аренда МиМ , строительной техники, перебазировка',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '9',
            'title' => 'Инструмент',
            'description' => '',
            'children' => [
                [
                    'code' => '9.1',
                    'title' => 'Ручной инструмент',
                    'description' => 'Отвертки, молотки, клещи, ножи и пр.',
                    'children' => []
                ],
                [
                    'code' => '9.2',
                    'title' => 'Электроинструмент',
                    'description' => 'Дрели, шлиф. машинки и пр.',
                    'children' => []
                ],
                [
                    'code' => '9.3',
                    'title' => 'Расходники и прочие материалы',
                    'description' => 'Диски, мешки, скотч и пр.',
                    'children' => []
                ],
                [
                    'code' => '9.4',
                    'title' => 'Складское оборудование и спец.техника',
                    'description' => 'Рохли, тележки, подъемники, погрузчики, станки, стеллажи',
                    'children' => []
                ],
                [
                    'code' => '9.5',
                    'title' => 'Ремонт и содержание инструмента/техники',
                    'description' => '',
                    'children' => []
                ],
            ]
        ]
    ];

    public static function getCodes(): array
    {
        return static::$codes;
    }

    public static function getTitleByCode(string $code): string
    {
        $code = str_replace(',', '.', $code);
        foreach (static::$codes as $codeL1) {
            if ($code === $codeL1['code']) {
                return $codeL1['code'] . ' - ' . $codeL1['title'];
            }
            if (count($codeL1['children']) > 0) {
                foreach ($codeL1['children'] as $codeL2) {
                    if ($code === $codeL2['code']) {
                        return $codeL2['code'] . ' - ' . $codeL2['title'];
                    }
                    if (count($codeL2['children']) > 0) {
                        foreach ($codeL2['children'] as $codeL3) {
                            if ($code === $codeL3['code']) {
                                return $codeL3['code'] . ' - ' . $codeL3['title'];
                            }
                            if (count($codeL3['children']) > 0) {
                                foreach ($codeL3['children'] as $codeL4) {
                                    if ($code === $codeL4['code']) {
                                        return $codeL4['code'] . ' - ' . $codeL4['title'];
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }

        return $code;
    }

    public static function checkValid(string $code): string
    {
        $code = str_replace(',', '.', $code);
        foreach (static::$codes as $codeL1) {
            if ($code === $codeL1['code']) {
                return true;
            }
            if (count($codeL1['children']) > 0) {
                foreach ($codeL1['children'] as $codeL2) {
                    if ($code === $codeL2['code']) {
                        return true;
                    }
                    if (count($codeL2['children']) > 0) {
                        foreach ($codeL2['children'] as $codeL3) {
                            if ($code === $codeL3['code']) {
                                return true;
                            }
                            if (count($codeL3['children']) > 0) {
                                foreach ($codeL3['children'] as $codeL4) {
                                    if ($code === $codeL4['code']) {
                                        return true;
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }

        return false;
    }

}
