<?php

namespace App\Models;

use phpDocumentor\Reflection\Types\Integer;

class KostCode
{
    private static array $codes = [
        [
            'code' => '10',
            'title' => 'Поступления',
            'description' => '',
            'children' => [
                [
                    'code' => '10.1',
                    'title' => 'Аванс целевой',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.2',
                    'title' => 'Аванс общий',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.3',
                    'title' => 'Выполнение',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.4',
                    'title' => 'Гарантийное удержание',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.5',
                    'title' => 'Услуги генподряда, ретробонус',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.6',
                    'title' => 'Займ, кредит, %',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '10.7',
                    'title' => 'Трансфер',
                    'description' => 'Возврат депозитов, перевод собственных средств',
                    'children' => []
                ],
                [
                    'code' => '10.8',
                    'title' => 'Прочие поступления',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '0',
            'title' => 'Статья затрат еще не определена',
            'description' => '',
            'children' => [],
        ],
        [
            'code' => '1',
            'title' => 'Строительные работы',
            'description' => '',
            'children' => [
                [
                    'code' => '1.1',
                    'title' => 'Общестроительные работы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '1.1.1',
                            'title' => 'Монолитные работы (железобетонные работы)',
                            'description' => 'Расчистка территорий, разборка и демонтаж зданий и сооружений. Строительство временных дорог, инженерных сетей и сооружений. Разработка и уплотнение грунта. Опалубочные работы, армирование, бетонирование. Оклейочная гидроизоляция, обмазочная гидроизоляция, литая или напыляемая гидроизоляция, пропиточная гидроизоляция, инъекционная гидроизоляция. Свайные работы, монтаж шпунта, ростверков',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.2',
                            'title' => 'Металлоконструкции',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.3',
                            'title' => 'Фасадные работы (фасад и фасадное остекление)',
                            'description' => 'Фасад, окна, фасадные двери, витражи',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.4',
                            'title' => 'Кровельные работы',
                            'description' => 'Скатные и плоские кровли, отливы, желобы',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.5',
                            'title' => 'Ограждения, лестницы',
                            'description' => 'Ограждения внутренние и наружные',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.6',
                            'title' => 'Разные работы, лабораторные исследования, геодезические работы',
                            'description' => 'Аренда геодезического оборудования. Сверление отверстий, уборка, подъём материалов, определение прочности бетона, ВИК сварных соединений',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.7',
                            'title' => 'Благоустройство',
                            'description' => 'Работы по благоустройству территории, озеленение, дорожки, площадки',
                            'children' => []
                        ],
                        [
                            'code' => '1.1.100',
                            'title' => 'Архив (Материалы)',
                            'description' => '',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '1.2',
                    'title' => 'Черновые и отделочные работы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '1.2.1',
                            'title' => 'Черновая отделка',
                            'description' => 'Кирпичная кладка, штукатурка, стяжка, гипсокартонные перегородки, облицовка и потолки',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.2',
                            'title' => 'Полы',
                            'description' => 'Финишная отделка полов, паркет, камень, плитка, ламинат, ковровые покрытия, линолеум, виниловые покрытия, эпоксидные покрытия',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.3',
                            'title' => 'Стены',
                            'description' => 'Финишная отделка стен, малярка, обои, декоративная штукатурка, камень, плитка, изделия из металла',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.4',
                            'title' => 'Потолки',
                            'description' => 'Финишная отделка потолков, малярка, обои, натяжные потолки, минеральные потолки, металические потолки',
                            'children' => []
                        ],
                        [
                            'code' => '1.2.100',
                            'title' => 'Архив (Материалы)',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ]
            ]
        ],
        [
            'code' => '2',
            'title' => 'Механические системы',
            'description' => '',
            'children' => [
                [
                    'code' => '2.1',
                    'title' => 'Внутренние системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '2.1.1',
                            'title' => 'Отопление',
                            'description' => 'Монтаж систем отопления, трубная разводка оконечного оборудования, отопительных приборов, изоляция',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.2',
                            'title' => 'Вентиляция',
                            'description' => 'Монтаж воздуховодов, отводов, переходов. Монтаж оборудования системы вентиляции, вентиляторы, фильтры, калориферы, изоляция',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.3',
                            'title' => 'Кондиционирование',
                            'description' => 'Монтаж систем кондиционирования, трубная разводка, система дренажа. Монтаж оборудования систем кондиционирования, кондиционеры, чилеры, изоляция',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.4',
                            'title' => 'ИТП и котельная',
                            'description' => 'Монтаж оборудовани котельной. Укладка трубопроводов газоснабжения, монтаж запорной арматуры и оборудования - если снабжение газом',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.5',
                            'title' => 'Спринклерная система пожаротушения, гидранты',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.6',
                            'title' => 'Водопровод и канализация, оборудование ВК',
                            'description' => 'Оборудование систем ВК, трапы, насосы. Монтаж систем водоснабжения и канализации, трубная разводка, изоляция',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.100',
                            'title' => 'Архив (Изоляция)',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '2.1.101',
                            'title' => 'Архив (Материалы)',
                            'description' => '',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '2.2',
                    'title' => 'Наружные системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '2.2.1',
                            'title' => 'Наружные механические системы',
                            'description' => 'Теплотрасса, водоснабжение и канализация / Укладка трубопроводов водопроводных, монтаж запорной арматуры и оборудования водопроводных сетей, устройство водопроводных колодцев. Проведение трубопроводов теплоснабжения, монтаж запорной арматуры и оборудования сетей теплоснабжения, устройство колодцев и камер сетей теплоснабжения',
                            'children' => []
                        ],
                    ]
                ]
            ]
        ],
        [
            'code' => '3',
            'title' => 'Электрические системы',
            'description' => '',
            'children' => [
                [
                    'code' => '3.1',
                    'title' => 'Наружные системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '3.1.1',
                            'title' => 'Наружные электрические системы',
                            'description' => 'Сильный, слабый ток. Наружное и фасное освещение. ДГУ / Кабельная продукция, колодцы, кабельная канализация, силовое оборудование',
                            'children' => []
                        ],
                    ]
                ],
                [
                    'code' => '3.2',
                    'title' => 'Внутренние системы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '3.2.1',
                            'title' => 'Сильный ток',
                            'description' => 'Кабельная продукция, силовое оборудование, щитовое оборудование, оконечное оборудование, светильники, розетки, выключатели',
                            'children' => []
                        ],
                        [
                            'code' => '3.2.2',
                            'title' => 'Слабый ток',
                            'description' => 'Кабельная продукция, слаботочное оборудование, оконечные элементы слаботочных систем',
                            'children' => []
                        ],
                        [
                            'code' => '3.2.3',
                            'title' => 'Автоматика',
                            'description' => 'Кабельная продукция, оконечные элементы систем автоматики',
                            'children' => []
                        ],
                        [
                            'code' => '3.2.4',
                            'title' => 'Мультимедиа',
                            'description' => 'Системы отображения, озвучивания, спикерфоны, конгресс-системы, электрнные очереди и др',
                            'children' => []
                        ],
                    ]
                ]
            ]
        ],
        [
            'code' => '4',
            'title' => 'Оснащение',
            'description' => '',
            'children' => [
                [
                    'code' => '4.1',
                    'title' => 'Мебель',
                    'description' => 'Встраиваемая и отдельностоящая мебель, стеновые панели',
                    'children' => []
                ],
                [
                    'code' => '4.2',
                    'title' => 'Лифты и эскалаторы',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '4.3',
                    'title' => 'Технологическое оборудование',
                    'description' => 'Кухонная техника, ТВ, мусоропровод, белепровод, оборудования для бассейнов',
                    'children' => []
                ],
                [
                    'code' => '4.4',
                    'title' => 'Элементы декора',
                    'description' => 'Зеркала, шторы, декаративные элементы и прочее',
                    'children' => []
                ],
                [
                    'code' => '4.5',
                    'title' => 'Двери',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '4.6',
                    'title' => 'Сантехника',
                    'description' => 'Сантехника, ванны, унитазы, бидэ, раковины, смесители',
                    'children' => []
                ],
                [
                    'code' => '4.100',
                    'title' => 'Архив (Дизайн освещение)',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '5',
            'title' => 'Содержание площадки',
            'description' => '',
            'children' => [
                [
                    'code' => '5.1',
                    'title' => 'Штаб строительства / городок',
                    'description' => 'Расходы на содержание ИТР / Покупка или аренда контейнеров, а так же их содержание и обслуживание, монтаж и обслуживание пожарной сигнализации, складские контейнеры, мебель, подушки, кровати',
                    'children' => []
                ],
                [
                    'code' => '5.2',
                    'title' => 'Командировочные расходы объекта',
                    'description' => 'Гостиница, питание, трансфер, билеты, аренда автомобилей',
                    'children' => []
                ],
                [
                    'code' => '5.3',
                    'title' => 'Система учета и контроля',
                    'description' => 'КПП, видеонаблюдение, пост охраны, СКУД',
                    'children' => []
                ],
                [
                    'code' => '5.4',
                    'title' => 'ЧОП/охрана объекта',
                    'description' => 'Охранные услуги',
                    'children' => []
                ],
                [
                    'code' => '5.5',
                    'title' => 'Временное подключение к сетям',
                    'description' => 'Электричество, отопление, канализация (откачка септика, аренда туалетных кабин), временный водопровод, временная котельная, газоснабжение',
                    'children' => []
                ],
                [
                    'code' => '5.6',
                    'title' => 'Вывоз мусора',
                    'description' => 'Вывоз мусора, аренда мусорных контейнеров',
                    'children' => []
                ],
                [
                    'code' => '5.7',
                    'title' => 'Коммунальные услуги объекта',
                    'description' => 'Электричество, водоснабжение и др.',
                    'children' => []
                ],
                [
                    'code' => '5.8',
                    'title' => 'Спецодежда и СИЗ',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '5.9',
                    'title' => 'Охрана труда (кроме спецодежды и СИЗ)',
                    'description' => 'Обучение по охране труда, проведение мед. осмотров водтелей, знаки безопасности и плакаты, противопожарный инвентарь, консультативные услуги в природоохранной области и т.д.',
                    'children' => []
                ],
                [
                    'code' => '5.10',
                    'title' => 'Миграционный учет объекта',
                    'description' => 'Оплата проезда в миграционные центры, а также другие расходы, связанные с получением патентов, приглашений, виз, страховок и прочее. Расходы за ведение воинского учёта, переводов документов, квотирование',
                    'children' => []
                ],
                [
                    'code' => '5.11',
                    'title' => 'Транспорт объектовых сотрудников / подрядчиков',
                    'description' => 'Авиа, ж/д билеты',
                    'children' => [
                        [
                            'code' => '5.11.1',
                            'title' => 'Транспорт сотрудников',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '5.11.2',
                            'title' => 'Транспорт подрядчиков',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '5.12',
                    'title' => 'Транспортные расходы объекта',
                    'description' => 'Оплата услуг пассажирских перевозок, заказ автобусов. Оплата проездных сотрудникам, пополнение топливных карт',
                    'children' => []
                ],
                [
                    'code' => '5.13',
                    'title' => 'Питание объектовых сотрудников / подрядчиков',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '5.13.1',
                            'title' => 'Питание сотрудников',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '5.13.2',
                            'title' => 'Питание подрядчиков',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '5.14',
                    'title' => 'Размещение объектовых сотрудников / подрядчиков',
                    'description' => 'Аренда квартир (аренда, ЖКХ услуги, парковка). Аренда общежитий, гостиниц, хостел',
                    'children' => [
                        [
                            'code' => '5.14.1',
                            'title' => 'Размещение сотрудников',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '5.14.2',
                            'title' => 'Размещение подрядчиков',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '5.15',
                    'title' => 'Услуги связи объекта',
                    'description' => 'Оплата интернет-провайдеров в офисах, услуги телефонии в офисах, мобильная связь',
                    'children' => []
                ],
                [
                    'code' => '5.16',
                    'title' => 'Оргтехника объекта',
                    'description' => 'Покупка компьютерной техники (ноутбуков, мониторов, принтеров, жестких дисков, сетевых расходных материалов, флеш накопителей и пр.). Обслуживание МФУ (ремонт МФУ, замена/заправка картриджей)',
                    'children' => []
                ],
                [
                    'code' => '5.17',
                    'title' => 'Расходы строительного офиса',
                    'description' => 'Оплата канцтоваров, бакалеи, питьевой воды, посуды, хоз.товаров, лекарств',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '6',
            'title' => 'Проектирование',
            'description' => '',
            'children' => [
                [
                    'code' => '6.1',
                    'title' => 'Архитектурные и конструктивные решения/Дизайнерская концепция и дизайн проект',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.2',
                    'title' => 'Консультационно-информацационные услгуи',
                    'description' => 'Авторский надзор, ГИП, 3D сьемка объекта',
                    'children' => []
                ],
                [
                    'code' => '6.3',
                    'title' => 'Механичечские системы / Водопровод, канализация, отопление и др.',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '6.4',
                    'title' => 'Электрические системы',
                    'description' => 'Сильные и слабые токи, автоматика, мультимедиа',
                    'children' => []
                ],
                [
                    'code' => '6.5',
                    'title' => 'Остальные разделы',
                    'description' => 'Энергоэффективность, Маломобильние группы населения, ПОС, Охрана окружающей среды',
                    'children' => []
                ]
            ]
        ],
        [
            'code' => '7',
            'title' => 'Офисные расходы',
            'description' => '',
            'children' => [
                [
                    'code' => '7.1',
                    'title' => 'НДС',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.2',
                    'title' => 'Налог на прибыль',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.3',
                    'title' => 'Налоги с зарплаты',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '7.3.1',
                            'title' => 'НДФЛ',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '7.3.2',
                            'title' => 'Соц.страхование, взносы',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.4',
                    'title' => 'Штрафы, пени, неустойки, госпошлины',
                    'description' => 'По налогам',
                    'children' => []
                ],
                [
                    'code' => '7.5',
                    'title' => 'Прочие налоги',
                    'description' => 'Траспортный налог, налог на имущество',
                    'children' => []
                ],
                [
                    'code' => '7.6',
                    'title' => 'Банковские затраты',
                    'description' => 'Комиссии по БГ, услуги РКО',
                    'children' => []
                ],
                [
                    'code' => '7.7',
                    'title' => 'Кредиты, займы',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '7.7.1',
                            'title' => 'Займы, кредиты банка и юр.лиц',
                            'description' => '% по кредитам, возврат кредитов и займов',
                            'children' => []
                        ],
                        [
                            'code' => '7.7.2',
                            'title' => 'Займы сотрудникам и физ.лицам',
                            'description' => '% по займам, возврат займов',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.8',
                    'title' => 'Аванс',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '7.8.1',
                            'title' => 'Аванс (ИТР)',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '7.8.2',
                            'title' => 'Аванс (Рабочие)',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.9',
                    'title' => 'Зарплата',
                    'description' => '',
                    'children' => [
                        [
                            'code' => '7.9.1',
                            'title' => 'Зарплата (ИТР)',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '7.9.2',
                            'title' => 'Зарплата (Рабочие)',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.10',
                    'title' => 'Премия',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.11',
                    'title' => 'Трансфер %',
                    'description' => 'Расходы трансфера',
                    'children' => [
                        [
                            'code' => '7.11.1',
                            'title' => 'Услуги траснфера',
                            'description' => '',
                            'children' => []
                        ],
                        [
                            'code' => '7.11.2',
                            'title' => 'НДФЛ (трансфер)',
                            'description' => '',
                            'children' => []
                        ]
                    ]
                ],
                [
                    'code' => '7.12',
                    'title' => 'Кадровые расходы и миграционный учет',
                    'description' => 'Оплата проезда в Сахарово и др. миграционные центры, а также другие расходы связанные с получением патентов, приглашений, виз, страховок и прочее. Оплата сервисов по подбору сотрудников (HeadHunter).Расходы за ведение воинского учёта, переводов документов, квотирование. Оплата ДМС для рук-ва компании, обучение персонала / тренинги/повышение квалификации',
                    'children' => []
                ],
                [
                    'code' => '7.13',
                    'title' => 'Размещение офисных сотрудниов',
                    'description' => 'Аренда квартир сотрудникам (аренда, ЖКХ услуги, парковка) по Москве. Аренда общежитий, гостиниц, хостел  по Москве',
                    'children' => []
                ],
                [
                    'code' => '7.14',
                    'title' => 'Транспорт офисных сотрудников (авиа/железнодорожный)',
                    'description' => 'Отпуска',
                    'children' => []
                ],
                [
                    'code' => '7.15',
                    'title' => 'Транспорт офисных сотрудников',
                    'description' => 'Оплата услуг пассажирских перевозок (заказ автобусов, такси). Оплата проездных сотрудникам',
                    'children' => []
                ],
                [
                    'code' => '7.16',
                    'title' => 'Бухгалтерские услуги',
                    'description' => 'Оплата услуг аудита, базы данных Главбух, СКЗИ (Средства криптографической защиты)',
                    'children' => []
                ],
                [
                    'code' => '7.17',
                    'title' => 'СРО (Разрешение на работу/членские взносы), сертификация, лицензирование',
                    'description' => 'Оплата членских взносов саморегулируемых организаций, юридических сертификатов и лицензий',
                    'children' => []
                ],
                [
                    'code' => '7.18',
                    'title' => 'Консалтинг',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.19',
                    'title' => 'Юридические услуги',
                    'description' => 'Оплата адвоката, оплата нотариуса, юридических гос.пошлин',
                    'children' => []
                ],
                [
                    'code' => '7.20',
                    'title' => 'Страхование',
                    'description' => 'Страхование работ СМР, Страхование гражданской ответственности',
                    'children' => []
                ],
                [
                    'code' => '7.21',
                    'title' => 'Аренда офиса',
                    'description' => 'Оплата аренды офисов, обслуживание офисов (ЖКХ (водоснабжение, электричество) Охрана, БТИ)',
                    'children' => []
                ],
                [
                    'code' => '7.22',
                    'title' => 'Аренда склада',
                    'description' => 'Оплата аренды склада',
                    'children' => []
                ],
                [
                    'code' => '7.23',
                    'title' => 'Капитальный ремонт офиса, мебель',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '7.24',
                    'title' => 'Расходы офиса',
                    'description' => 'Оплата канцтоваров, кофе, питьевой воды, посуды, хоз.товаров, лекарств и т.д.',
                    'children' => []
                ],
                [
                    'code' => '7.25',
                    'title' => 'Маркетинг',
                    'description' => 'Оплата SMM (Маркетинг в социальных сетях). Расходы на рекламную продукцию (визитки, таблички, пакеты, шевроны, вымпелы, буклеты, блокноты и т.д.) Выставки, семинары, мероприятия. Расходы на презенты',
                    'children' => []
                ],
                [
                    'code' => '7.26',
                    'title' => 'Отправка документов',
                    'description' => 'Расходы на почтово-курьерские услуги',
                    'children' => []
                ],
                [
                    'code' => '7.27',
                    'title' => 'Услуги связи',
                    'description' => 'Оплата интернет-провайдеров в офисах, МГТС услуги телефонии в офисах, мобильная связь',
                    'children' => []
                ],
                [
                    'code' => '7.28',
                    'title' => 'Оргтехника (МФУ, компьютерная техника)',
                    'description' => 'Покупка компьютерной техники (ноутбуков, мониторов, принтеров, жестких дисков, сетевых расходных материалов, флеш накопителей и пр.). Обслуживание МФУ (ремонт МФУ, замена/заправка картриджей)',
                    'children' => []
                ],
                [
                    'code' => '7.29',
                    'title' => 'Программное обеспечение',
                    'description' => 'Разработка и сопровождение ПО',
                    'children' => []
                ],
                [
                    'code' => '7.30',
                    'title' => 'Топливо',
                    'description' => 'Пополнение счёта топливных карт АЗС, бензин, дизтопливо, ГСМ',
                    'children' => []
                ],
                [
                    'code' => '7.31',
                    'title' => 'Расходы на автотранспорт (лизинг, ТО, запчасти, страхование (КАСКО, ОСАГО))',
                    'description' => 'Расходы на приобретение автомобилей и спецтехники (Лизинг). Обслуживание автомобилей и спецтехники (замена расходников, ремонт, ГЛОНАС, установка сигнализации, вызов эвакуатора для автомобилей). Оплата парковок, платных дорог. Страхование автомобилей (ОСАГО, КАСКО), штрафы ГИБДД',
                    'children' => []
                ],
                [
                    'code' => '7.32',
                    'title' => 'Представительские расходы',
                    'description' => 'Проведение праздников, благотворительность, представительские расходы',
                    'children' => []
                ],
                [
                    'code' => '7.33',
                    'title' => 'Переброска',
                    'description' => 'Перевод собственных, переброска денег между кассами, ошибочные плтежи с ДТ',
                    'children' => []
                ],
                [
                    'code' => '7.100',
                    'title' => 'Архив (Налог на имущество)',
                    'description' => 'Оплата разработки 1С, разработки ПО для ЭВМ, аудит IT,сопровождение 1С',
                    'children' => []
                ],
                [
                    'code' => '7.101',
                    'title' => 'Архив (Транспорт сотрудников (от места пребывания до стройки))',
                    'description' => '',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '8',
            'title' => 'Транспортные услуги',
            'description' => '',
            'children' => [
                [
                    'code' => '8.1',
                    'title' => 'Аренда техники',
                    'description' => 'Аренда МиМ , строительной техники, перебазировка',
                    'children' => []
                ],
                [
                    'code' => '8.2',
                    'title' => 'Услуги грузовой доставки',
                    'description' => 'Оплата за услуги доставки грузов ',
                    'children' => []
                ],
            ]
        ],
        [
            'code' => '9',
            'title' => 'Инструмент и оборудование',
            'description' => '',
            'children' => [
                [
                    'code' => '9.1',
                    'title' => 'Ручной инструмент',
                    'description' => 'Отвертки, молотки, клещи, ножи и пр.',
                    'children' => []
                ],
                [
                    'code' => '9.2',
                    'title' => 'Электроинструмент',
                    'description' => 'Дрели, шлиф. машинки и пр.',
                    'children' => []
                ],
                [
                    'code' => '9.3',
                    'title' => 'Расходники и прочие материалы ',
                    'description' => 'Диски, мешки, скотч и пр., QR коды, метки, штрих-коды',
                    'children' => []
                ],
                [
                    'code' => '9.4',
                    'title' => 'Складское оборудование и спец.техника',
                    'description' => 'Рохли, тележки, подъемники, погрузчики, станки, стеллажи, насосы',
                    'children' => []
                ],
                [
                    'code' => '9.5',
                    'title' => 'Ремонт и содержание инструмента/техники',
                    'description' => '',
                    'children' => []
                ],
                [
                    'code' => '9.6',
                    'title' => 'Оборудование',
                    'description' => 'Газонокосилка, бетономешалка, снегоплавиьная установка и прочее',
                    'children' => []
                ],
                [
                    'code' => '9.7',
                    'title' => 'Аренда оборудования и инструмента',
                    'description' => 'Опалубка, леса, вышка-тура и др.',
                    'children' => []
                ],
            ]
        ]
    ];

    public static function getCodes(): array
    {
        $id = 1;
        $codesWithId = static::$codes;
        foreach ($codesWithId as &$codeL1) {
            $codeL1['id'] = $id++;
            if (count($codeL1['children']) > 0) {
                foreach ($codeL1['children'] as &$codeL2) {
                    $codeL2['id'] = $id++;

                    if (count($codeL2['children']) > 0) {
                        foreach ($codeL2['children'] as &$codeL3) {
                            $codeL3['id'] = $id++;

                            if (count($codeL3['children']) > 0) {
                                foreach ($codeL3['children'] as &$codeL4) {
                                    $codeL4['id'] = $id++;
                                }
                            }
                        }
                    }
                }
            }
        }

        return $codesWithId;
    }

    public static function getTitleByCode(string $code): string
    {
        $code = str_replace(',', '.', $code);
        foreach (static::$codes as $codeL1) {
            if ($code === $codeL1['code']) {
                return $codeL1['code'] . ' - ' . $codeL1['title'];
            }
            if (count($codeL1['children']) > 0) {
                foreach ($codeL1['children'] as $codeL2) {
                    if ($code === $codeL2['code']) {
                        return $codeL2['code'] . ' - ' . $codeL2['title'];
                    }
                    if (count($codeL2['children']) > 0) {
                        foreach ($codeL2['children'] as $codeL3) {
                            if ($code === $codeL3['code']) {
                                return $codeL3['code'] . ' - ' . $codeL3['title'];
                            }
                            if (count($codeL3['children']) > 0) {
                                foreach ($codeL3['children'] as $codeL4) {
                                    if ($code === $codeL4['code']) {
                                        return $codeL4['code'] . ' - ' . $codeL4['title'];
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }

        return $code;
    }

    public static function checkValid(string $code): string
    {
        return in_array($code, array_keys(KostCode::getCodesWithId()));
    }

    public static function getCodesWithId(): array
    {
        $codesWithId = [];
        foreach (static::getCodes() as $codeL1) {
            $codesWithId[$codeL1['code']] = $codeL1['id'];
            if (count($codeL1['children']) > 0) {
                foreach ($codeL1['children'] as $codeL2) {
                    $codesWithId[$codeL2['code']] = $codeL2['id'];
                    if (count($codeL2['children']) > 0) {
                        foreach ($codeL2['children'] as $codeL3) {
                            $codesWithId[$codeL3['code']] = $codeL3['id'];
                            if (count($codeL3['children']) > 0) {
                                foreach ($codeL3['children'] as $codeL4) {
                                    $codesWithId[$codeL4['code']] = $codeL4['id'];
                                }
                            }
                        }
                    }
                }
            }
        }

        return $codesWithId;
    }

    public static function getCodesForPayment(): array
    {
        $codes = [];
        foreach (static::getCodes() as $codeL1) {
            if (count($codeL1['children']) === 0) {
                $codes[] = $codeL1['code'];
                continue;
            }

            foreach ($codeL1['children'] as $codeL2) {
                if (count($codeL2['children']) === 0) {
                    $codes[] = $codeL2['code'];
                    continue;
                }

                foreach ($codeL2['children'] as $codeL3) {
                    if (count($codeL3['children']) === 0) {
                        $codes[] = $codeL3['code'];
                        continue;
                    }

                    foreach ($codeL3['children'] as $codeL4) {
                        $codes[] = $codeL4['code'];
                    }
                }
            }
        }

        return $codes;
    }
}
