app/Models/Statement.php

    public function reCalculateAmountsAndCounts(): void
    {
        $payments = $this->payments;
        $this->update([
            'payments_count' => $payments->count(),
            'amount_pay' => $payments->where('amount', '<', 0)->sum('amount'),
            'amount_receive' => $payments->where('amount', '>=', 0)->sum('amount'),
            'status_id' => $payments->where('status_id', Status::STATUS_BLOCKED)->count() > 0
                ? Status::STATUS_BLOCKED
                : Status::STATUS_ACTIVE,
        ]);
---
select * from `payments` where `payments`.`statement_id` = 1 and `payments`.`statement_id` is not null and `payments`.`deleted_at` is null